#pragma once
#include <iostream>
#include <string>

void error404()
{
		std::string Message = "Код ошибки: 404 - Не найдено";

		// находим символ ":" в строке Message и сохраняем его позицию в переменной found
		size_t found = Message.find(':');


		//вычисляем позицию начала кода ошибки, добавляя 2 к позиции найденного символа ":" (чтобы пропустить ": " и начать с цифр кода ошибки)
		size_t code_start = found + 2;
		// извлекаем код ошибки из строки Message, используя метод substr(), который принимает позицию начала и количество символов для извлечения. 
		// В данном случае мы извлекаем 3 символа, начиная с позиции code_start, что соответствует коду ошибки "404".
		std::string errorz = Message.substr(code_start, 3);

		// ищем другое слово "- Не найдено" в строке Message и сохраняем его позицию в переменной found2
		size_t found2 = Message.find("- Не найдено");

		//проверяем найдено ли слово "- Не найдено" в строке Message. Если метод find() не может найти искомую подстроку, 
		// он возвращает специальное значение std::string::npos.
		if (found2 != std::string::npos)
		{
			// если да, то удаляем его из строки Message с помощью метода erase(), который принимает позицию начала и количество символов для удаления.
			Message.erase(found2);
		}

		//вывод -w-
		std::cout << errorz << std::endl;
		std::cout << Message << std::endl;

	}

