#pragma once
#include <iostream>
#include <string>
void fund()
	{
		std::string text = "C++ – мощный язык программирования. Класс string очень удобен.";
		std::cout << text << std::endl;
		std::string word = "язык";
		std::cout << word << std::endl;

		//size_t - это тип данных, который используется для представления размера объектов в байтах. Он гарантированно беззнаковый и достаточно большой, 
		// чтобы вместить размер любого объекта, который может быть создан на данной платформе. Обычно он используется для индексации массивов 
		// и хранения размеров строк и других контейнеров.
		size_t found = text.find(word);

		//туть мы проверяем , найдено ли слово в тексте. Если метод find() не может найти искомую подстроку, он возвращает специальное значение std::string::npos,
		if (found != std::string::npos)
		{
			std::cout << "Слово '" << word << "' найдено в тексте на позиции: " << found << std::endl;
		}
		else
		{
			std::cout << "Слово '" << word << "' не найдено в тексте." << std::endl;
		}
	}

