#pragma once
#include <iostream>
#include <string>
void insert_replace()
{
		std::string text = "Сегодня хорошая погода.";
		std::cout << text << std::endl;

		//задаем слово, которре мы хотим найти и заменить
		size_t insertPos = text.find("хорошая");

		//туть мы проверяем , найдено ли слово "хорошая" в тексте. Если метод find() не может найти искомую подстроку, 
		// он возвращает специальное значение std::string::npos,
		if (insertPos != std::string::npos)
		{
			//заменяем с помощью методп insert() - который позволяет вставлять подстроку в определенную позицию в строке.
			text.insert(insertPos, "очень ");
		}
		// если нет, то просто выводим сообщение о том, что слово не найдено
		else
		{
			std::cout << "Слово 'хорошая' не найдено в тексте." << std::endl;
		}
		std::cout << text << std::endl;



		//также мы можем заменить слово "хорошая" на "прекрасная" с помощью метода replace(), который позволяет заменить часть строки на другую строку,
		size_t replacePos = text.find("хорошая");
		if(replacePos != std::string::npos)
		{
			// туть мы указываем позицию, с которой начинается слово "хорошая", затем длину слова "хорошая" и строку "прекрасная", на которую мы хотим заменить
			text.replace(replacePos, std::string("хорошая").length(), "прекрасная");
		}
		else
		{
			std::cout << "Слово 'хорошая' не найдено в тексте." << std::endl;
		}

		std::cout << text << std::endl;
}

