#pragma once
#include <iostream>
#include <string>
void toupper1()
{
		std::string myString;
		std::cin.ignore(); // Очистка буфера ввода перед чтением строки
		std::cout << myString << std::endl;
		std::getline(std::cin, myString);

		// тут мы проходим по каждому символу строки и проверяем, является ли он пробелом. 
		// Если это так, мы устанавливаем флаг hasLowercase в true, что означает, что следующий символ должен быть преобразован в верхний регистр. 
		// Если символ не является пробелом и флаг hasLowercase установлен в true, мы преобразуем его в верхний регистр и сбрасываем флаг.
		bool hasLowercase = true;

		// как раз этот цикл
		for (char &c : myString)
		{
			// если пробел
			if (c == ' ')
			{
				// то следующий символ должен быть в верхнем регистре
				hasLowercase = true;
			}
			// опять проходим по тому же, теперь он не проблел а флаг устоновлен на тру, то туть все выполнеться и пойдей дальше
			else {
				// если флаг установлен, то преобразуем символ в верхний регистр
				if (hasLowercase)
				{
					// как раз туть мы ставим символ в верхний регистр
					c = toupper(c);
					// и сбрасываем флаг
					hasLowercase = false;
				}
			}
		}
		std::cout << "Преобразованная строка: " << myString << std::endl;
}

